levizh/hc32m423/ddl/hc32m423_ddl/mcu/EWARM/HDSC_HC32M423.svd
                <register>
                    <name>RSTF0</name>
                    <description>desc RSTF0</description>
                    <addressOffset>0x100</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF5FF</resetMask>
                    <fields>
                        <field>
                            <name>PORF</name>
                            <description>desc PORF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PINRF</name>
                            <description>desc PINRF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LV0RF</name>
                            <description>desc LV0RF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LV1RF</name>
                            <description>desc LV1RF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LV2RF</name>
                            <description>desc LV2RF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWDRF</name>
                            <description>desc SWDRF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDRF</name>
                            <description>desc WDRF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKFERF</name>
                            <description>desc CKFERF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRF</name>
                            <description>desc SWRF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPERF</name>
                            <description>desc RAMPERF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPULKUPRF</name>
                            <description>desc CPULKUPRF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALERF</name>
                            <description>desc XTALERF</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MULTIRF</name>
                            <description>desc MULTIRF</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLRF</name>
                            <description>desc CLRF</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>FCM</name>
            <description>desc FCM</description>
            <baseAddress>0x40048400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x24</size>
            </addressBlock>
            <registers>
                <register>
                    <name>LVR</name>
                    <description>desc LVR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LVR</name>
                            <description>desc LVR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UVR</name>
                    <description>desc UVR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UVR</name>
                            <description>desc UVR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNTR</name>
                    <description>desc CNTR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CNTR</name>
                            <description>desc CNTR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STR</name>
                    <description>desc STR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>desc START</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCCR</name>
                    <description>desc MCCR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF3</resetMask>
                    <fields>
                        <field>
                            <name>MDIVS</name>
                            <description>desc MDIVS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCKS</name>
                            <description>desc MCKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCCR</name>
                    <description>desc RCCR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB3FB</resetMask>
                    <fields>
                        <field>
                            <name>RDIVS</name>
                            <description>desc RDIVS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCKS</name>
                            <description>desc RCKS</description>
                            <msb>6</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEXS</name>
                            <description>desc INEXS</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DNFS</name>
                            <description>desc DNFS</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDGES</name>
                            <description>desc EDGES</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXREFE</name>
                            <description>desc EXREFE</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RIER</name>
                    <description>desc RIER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x97</resetMask>
                    <fields>
                        <field>
                            <name>ERRIE</name>
                            <description>desc ERRIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MENDIE</name>
                            <description>desc MENDIE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFIE</name>
                            <description>desc OVFIE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRINTRS</name>
                            <description>desc ERRINTRS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRE</name>
                            <description>desc ERRE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>ERRF</name>
                            <description>desc ERRF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MENDF</name>
                            <description>desc MENDF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OVF</name>
                            <description>desc OVF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLR</name>
                    <description>desc CLR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>ERRFCLR</name>
                            <description>desc ERRFCLR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MENDFCLR</name>
                            <description>desc MENDFCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OVFCLR</name>
                            <description>desc OVFCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
