levizh/hc32m423/ddl/hc32m423_ddl/mcu/EWARM/HDSC_HC32M423.svd
                <register>
                    <name>OCMRUH</name>
                    <description>desc OCMRUH</description>
                    <addressOffset>0x24</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OCFDCHUH</name>
                            <description>desc OCFDCHUH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFPKHUH</name>
                            <description>desc OCFPKHUH</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFUCHUH</name>
                            <description>desc OCFUCHUH</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFZRHUH</name>
                            <description>desc OCFZRHUH</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPDCHUH</name>
                            <description>desc OPDCHUH</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPPKHUH</name>
                            <description>desc OPPKHUH</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPUCHUH</name>
                            <description>desc OPUCHUH</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPZRHUH</name>
                            <description>desc OPZRHUH</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNPKHUH</name>
                            <description>desc OPNPKHUH</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNZRHUH</name>
                            <description>desc OPNZRHUH</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OCMRUL</name>
                    <description>desc OCMRUL</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OCFDCLUL</name>
                            <description>desc OCFDCLUL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFPKLUL</name>
                            <description>desc OCFPKLUL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFUCLUL</name>
                            <description>desc OCFUCLUL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFZRLUL</name>
                            <description>desc OCFZRLUL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPDCLUL</name>
                            <description>desc OPDCLUL</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPPKLUL</name>
                            <description>desc OPPKLUL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPUCLUL</name>
                            <description>desc OPUCLUL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPZRLUL</name>
                            <description>desc OPZRLUL</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNPKLUL</name>
                            <description>desc OPNPKLUL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNZRLUL</name>
                            <description>desc OPNZRLUL</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNDCLUL</name>
                            <description>desc EOPNDCLUL</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNUCLUL</name>
                            <description>desc EOPNUCLUL</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPDCLUL</name>
                            <description>desc EOPDCLUL</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPPKLUL</name>
                            <description>desc EOPPKLUL</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPUCLUL</name>
                            <description>desc EOPUCLUL</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPZRLUL</name>
                            <description>desc EOPZRLUL</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNPKLUL</name>
                            <description>desc EOPNPKLUL</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNZRLUL</name>
                            <description>desc EOPNZRLUL</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OCMRVH</name>
                    <description>desc OCMRVH</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OCFDCHVH</name>
                            <description>desc OCFDCHVH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFPKHVH</name>
                            <description>desc OCFPKHVH</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFUCHVH</name>
                            <description>desc OCFUCHVH</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFZRHVH</name>
                            <description>desc OCFZRHVH</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPDCHVH</name>
                            <description>desc OPDCHVH</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPPKHVH</name>
                            <description>desc OPPKHVH</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPUCHVH</name>
                            <description>desc OPUCHVH</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPZRHVH</name>
                            <description>desc OPZRHVH</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNPKHVH</name>
                            <description>desc OPNPKHVH</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNZRHVH</name>
                            <description>desc OPNZRHVH</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OCMRVL</name>
                    <description>desc OCMRVL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OCFDCLVL</name>
                            <description>desc OCFDCLVL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFPKLVL</name>
                            <description>desc OCFPKLVL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFUCLVL</name>
                            <description>desc OCFUCLVL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFZRLVL</name>
                            <description>desc OCFZRLVL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPDCLVL</name>
                            <description>desc OPDCLVL</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPPKLVL</name>
                            <description>desc OPPKLVL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPUCLVL</name>
                            <description>desc OPUCLVL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPZRLVL</name>
                            <description>desc OPZRLVL</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNPKLVL</name>
                            <description>desc OPNPKLVL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNZRLVL</name>
                            <description>desc OPNZRLVL</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNDCLVL</name>
                            <description>desc EOPNDCLVL</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNUCLVL</name>
                            <description>desc EOPNUCLVL</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPDCLVL</name>
                            <description>desc EOPDCLVL</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPPKLVL</name>
                            <description>desc EOPPKLVL</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPUCLVL</name>
                            <description>desc EOPUCLVL</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPZRLVL</name>
                            <description>desc EOPZRLVL</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNPKLVL</name>
                            <description>desc EOPNPKLVL</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPNZRLVL</name>
                            <description>desc EOPNZRLVL</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OCMRWH</name>
                    <description>desc OCMRWH</description>
                    <addressOffset>0x34</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OCFDCHWH</name>
                            <description>desc OCFDCHWH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFPKHWH</name>
                            <description>desc OCFPKHWH</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFUCHWH</name>
                            <description>desc OCFUCHWH</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCFZRHWH</name>
                            <description>desc OCFZRHWH</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPDCHWH</name>
                            <description>desc OPDCHWH</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPPKHWH</name>
                            <description>desc OPPKHWH</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPUCHWH</name>
                            <description>desc OPUCHWH</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPZRHWH</name>
                            <description>desc OPZRHWH</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNPKHWH</name>
                            <description>desc OPNPKHWH</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPNZRHWH</name>
                            <description>desc OPNZRHWH</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
